Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 38, 38, 32)        320
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 36, 36, 64)        18496
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 18, 18, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 18, 18, 64)        0
_________________________________________________________________
flatten_1 (Flatten)          (None, 20736)             0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               2654336
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 6)                 774
=================================================================
Total params: 2,673,926
Trainable params: 2,673,926
Non-trainable params: 0
_________________________________________________________________